# Project 08 -- Anthony Micco

**TA Help:** N/A

**Collaboration:** N/A

**Internet Resources:** N/A

**ChatGPT, Gemini, Claude, etc:** None

***Link to AI Chat History***: N/A \
**OVERALL MESSAGE:** Any time that you used anything except your brain to solve the questions in these projects, you need to disclose such resources at the start of the project, with details about your usage of the tools.

**YOUR OWN WORK:** Even when you utilize other resources, do NOT just copy and paste.  Write all explanations in your own words, using several sentences in English, which are understandable and which you wrote (and did not just copy and paste).

## Question 1

In [4]:
# copying the Lahman database to my local folder by using the python sqlite3 library

In [5]:
import sqlite3

# Load the Lahman database
read_only_lahman = sqlite3.connect('/anvil/projects/tdm/data/lahman/lahman.db')
local_lahman = sqlite3.connect('./lahman.db')

read_only_lahman.backup(local_lahman) # Backup the database to your local file
read_only_lahman.close()
local_lahman.close()

In [6]:
#connecting to the Lahman database

In [7]:
%sql sqlite:///./lahman.db

In [8]:
%%sql
SELECT * FROM Teams LIMIT 5;

 * sqlite:///./lahman.db
Done.

[(1871, 'NA', 'BS1', 'BNA', '', 3, 31, '', 20, 10, '', '', 'N', '', 401, 1372, 426, 70, 37, 3, 60, 19, 73, 16, '', '', 303, 109, 3.55, 22, 1, 3, 828, 367, 2, 42, 23, 243, 24, 0.834, 'Boston Red Stockings', 'South End Grounds I', '', 103, 98, 'BOS', 'BS1', 'BS1'),
 (1871, 'NA', 'CH1', 'CNA', '', 2, 28, '', 19, 9, '', '', 'N', '', 302, 1196, 323, 52, 21, 10, 60, 22, 69, 21, '', '', 241, 77, 2.76, 25, 0, 1, 753, 308, 6, 28, 22, 229, 16, 0.829, 'Chicago White Stockings', 'Union Base-Ball Grounds', '', 104, 102, 'CHI', 'CH1', 'CH1'),
 (1871, 'NA', 'CL1', 'CFC', '', 8, 29, '', 10, 19, '', '', 'N', '', 249, 1186, 328, 35, 40, 7, 26, 25, 18, 8, '', '', 341, 116, 4.11, 23, 0, 0, 762, 346, 13, 53, 34, 234, 15, 0.818, 'Cleveland Forest Citys', 'National Association Grounds', '', 96, 100, 'CLE', 'CL1', 'CL1'),
 (1871, 'NA', 'FW1', 'KEK', '', 7, 19, '', 7, 12, '', '', 'N', '', 137, 746, 178, 19, 8, 2, 33, 9, 16, 4, '', '', 243, 97, 5.17, 19, 1, 0, 507, 261, 5, 21, 17, 163, 8, 0.803, 'Fort Wayne Kekiongas', 'Hamilton Field', '', 101, 107, 'KEK', 'FW1', 'FW1'),
 (1871, 'NA', 'NY2', 'NNA', '', 5, 33, '', 16, 17, '', '', 'N', '', 302, 1404, 403, 43, 21, 1, 33, 15, 46, 15, '', '', 313, 121, 3.72, 32, 1, 0, 879, 373, 7, 42, 22, 235, 14, 0.84, 'New York Mutuals', 'Union Grounds (Brooklyn)', '', 90, 88, 'NYU', 'NY2', 'NY2')]

In [9]:
#practicing loading and connecting to a database using sqlite3 library with the chinook database

In [10]:
import sqlite3

#load in the db
chinook = sqlite3.connect('/anvil/projects/tdm/data/chinook/Chinook_Sqlite.sqlite')
local_db = sqlite3.connect('./chinook.sqlite')

chinook.backup(local_db)
chinook.close()
local_db.close()

In [11]:
%sql sqlite:///./chinook.sqlite

In [12]:
%%sql
SELECT * FROM Artist LIMIT 5

 * sqlite:///./chinook.sqlite
   sqlite:///./lahman.db
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

## Question 2

In [13]:
# connecting to my local lahman database

In [14]:
%sql sqlite:///./lahman.db

In [15]:
#creating a new table called MyPlayers

In [16]:
%%sql
CREATE TABLE MyPlayers (
    playerID TEXT PRIMARY KEY,
    name TEXT NOT NULL,
    teamID TEXT NOT NULL
)

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [17]:
#inserting a player into the MyPlayers table and checking to see if it is there

In [18]:
%%sql
INSERT INTO MyPlayers(playerID, name, teamID) 
VALUES('player1', 'John Doe','team1')

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
1 rows affected.

[]

In [19]:
%%sql
SELECT * FROM MyPlayers

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('player1', 'John Doe', 'team1')]

In [20]:
#inserting multiple players into the table and checking to ensure they are there

In [21]:
%%sql
INSERT INTO MyPlayers (playerID, name, teamID)
VALUES
('player2', 'Jane Smith', 'team1'),
('player3', 'Bob Johnson', 'team2'),
('player4', 'Alice Brown', 'team2');

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
3 rows affected.

[]

In [22]:
%%sql
SELECT * FROM MyPlayers

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('player1', 'John Doe', 'team1'),
 ('player2', 'Jane Smith', 'team1'),
 ('player3', 'Bob Johnson', 'team2'),
 ('player4', 'Alice Brown', 'team2')]

In [23]:
#inserting into the MyPlayers table from the 'master' players table and make sure it populated correctly

In [24]:
%%sql
INSERT INTO MyPlayers (playerID, name, teamID)
SELECT p.playerID, p.nameFirst || ' ' || p.nameLast AS name, MIN(s.teamID) AS teamID
FROM People p
JOIN Salaries s ON s.playerID = p.playerID
WHERE s.yearID = ( SELECT MAX(yearID) FROM Salaries s2 WHERE s2.playerID = s.playerID)
GROUP BY p.playerID;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
5149 rows affected.

[]

In [29]:
%%sql
SELECT * FROM MyPlayers ORDER BY playerID LIMIT 5

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('aardsda01', 'David Aardsma', 'NYA'),
 ('aasedo01', 'Don Aase', 'NYN'),
 ('abadan01', 'Andy Abad', 'CIN'),
 ('abadfe01', 'Fernando Abad', 'MIN'),
 ('abbotje01', 'Jeff Abbott', 'FLO')]

## Question 3

In [35]:
# using the alter table table to add the new column "age" to MyPlayers

In [36]:
%%sql
ALTER TABLE MyPlayers
ADD COLUMN age INTEGER;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [37]:
# using the alter table table to remove the column "teamID" from MyPlayers

In [38]:
%%sql
ALTER TABLE MyPlayers
DROP COLUMN teamID;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [39]:
#viewing the changes we made to the table

In [40]:
%%sql
SELECT * FROM MyPlayers LIMIT 5;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('player1', 'John Doe', None),
 ('player2', 'Jane Smith', None),
 ('player3', 'Bob Johnson', None),
 ('player4', 'Alice Brown', None),
 ('aardsda01', 'David Aardsma', None)]

In [41]:
# adding the new column "height" to MyPlayers

In [42]:
%%sql 
ALTER TABLE MyPlayers
ADD COLUMN height REAL;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [43]:
# adding the new column "weight" to MyPlayers

In [44]:
%%sql 
ALTER TABLE MyPlayers
ADD COLUMN weight REAL;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [45]:
#checking to see if the columns were added

In [47]:
%%sql
SELECT * FROM MyPlayers LIMIT 5

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('player1', 'John Doe', None, None, None),
 ('player2', 'Jane Smith', None, None, None),
 ('player3', 'Bob Johnson', None, None, None),
 ('player4', 'Alice Brown', None, None, None),
 ('aardsda01', 'David Aardsma', None, None, None)]

In [48]:
#creating 5 players with arbitary names, weights,heights and ids

In [49]:
%%sql
INSERT INTO MyPlayers(playerID, name, age, height, weight)
VALUES
('player5','Jim Jones',24,68,215),
('player6','John Smith',33,77,232),
('player7','Randy Austin',28,69,187),
('player8','Mario Amico',22,72,203),
('player9','Nick Bero',30,65,176);

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
5 rows affected.

[]

In [50]:
#Selecting the 5 tallest players ordered by height in descending order

In [51]:
%%sql 
SELECT * FROM MyPlayers ORDER BY height DESC LIMIT 5

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[('player6', 'John Smith', 33, 77.0, 232.0),
 ('player8', 'Mario Amico', 22, 72.0, 203.0),
 ('player7', 'Randy Austin', 28, 69.0, 187.0),
 ('player5', 'Jim Jones', 24, 68.0, 215.0),
 ('player9', 'Nick Bero', 30, 65.0, 176.0)]

## Question 4

In [52]:
#using the delete from command to a record from the table

In [53]:
%%sql 
DELETE FROM MyPlayers
WHERE playerID = 'player1';

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
1 rows affected.

[]

In [54]:
#checking to make sure the deletion occurred properly

In [55]:
%%sql
SELECT * FROM MyPlayers WHERE playerID = 'player1' LIMIT 5;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [56]:
#deleting all players from the table with a height less than 6 feet (72 inches)

In [57]:
%%sql
DELETE FROM MyPlayers
WHERE height < 72.0;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
3 rows affected.

[]

In [58]:
#confirming the deletion occurred properly

In [59]:
%%sql
SELECT * FROM MyPlayers WHERE height < 72.0 LIMIT 5;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

## Question 5

In [60]:
# running the delete table command to remove all the data from the table

In [61]:
%%sql
DELETE FROM MyPlayers;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
5154 rows affected.

[]

In [62]:
#deleting the entire table from the database using the drop table command

In [63]:
%%sql
DROP TABLE MyPlayers;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
Done.

[]

In [64]:
#checking to make sure the table was dropped correctly

In [65]:
%%sql
SELECT * FROM MyPlayers LIMIT 5;

   sqlite:///./chinook.sqlite
 * sqlite:///./lahman.db
(sqlite3.OperationalError) no such table: MyPlayers
[SQL: SELECT * FROM MyPlayers LIMIT 5;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

## Pledge

By submitting this work I hereby pledge that this is my own, personal work. I've acknowledged in the designated place at the top of this file all sources that I used to complete said work, including but not limited to: online resources, books, and electronic communications. I've noted all collaboration with fellow students and/or TA's. I did not copy or plagiarize another's work.

> As a Boilermaker pursuing academic excellence, I pledge to be honest and true in all that I do. Accountable together – We are Purdue.

https://www.purdue.edu/odos/osrr/honor-pledge/